@extends('site.layouts.main')

@section('title', '404')

@section('content')
    <div class="lost" id="error">
        <img src="{{ asset('site/assets/images/404/404.png')}}">
        <div class="lost__block">
            <div class="lost__title">
                <h1>it looks like you are lost</h1>
            </div>
            <a class="lost__button" href="{{ route("home") }}">return to homepage</a>
        </div>
    </div>


<section class="help_container">
<div style="display: none;" class="help_center-success">
    <div class="help_center_header">

        <button class="help_center_header-close">
            <svg xmlns="http://www.w3.org/2000/svg" width="60" height="60" viewBox="0 0 60 60" fill="none">
            <rect x="21.0712" y="37.0712" width="22" height="2" rx="1" transform="rotate(-45 21.0712 37.0712)" fill="#8D97A2"/>
            <rect x="36.6273" y="38.4854" width="22" height="2" rx="1" transform="rotate(-135 36.6273 38.4854)" fill="#8D97A2"/>
            </svg>
        </button>
    </div>
    <div class="help_center_main help_center_main-success">
            <h1>Спасибо за ваш вопрос!</h1>
            <h3>Обычно мы отвечаем в течении 60 минут, но иногда на наш ответ может понадобится чуть больше времени.</h3>
            <h3>Возможно ответ на ваш вопрос есть в наших социальных сетях:</h3>
            <div class="help_center_main-links">
                <a>
                    <svg xmlns="http://www.w3.org/2000/svg" width="60" height="60" viewBox="0 0 60 60" fill="#333333">
                        <path d="M47.67 21.99C47.25 20.43 46.02 19.2 44.46 18.78C41.61 18 30.21 18 30.21 18C30.21 18 18.81 18 15.96 18.75C14.43 19.17 13.17 20.43 12.75 21.99C12 24.84 12 30.75 12 30.75C12 30.75 12 36.69 12.75 39.51C13.17 41.07 14.4 42.3 15.96 42.72C18.84 43.5 30.21 43.5 30.21 43.5C30.21 43.5 41.61 43.5 44.46 42.75C46.02 42.33 47.25 41.1 47.67 39.54C48.42 36.69 48.42 30.78 48.42 30.78C48.42 30.78 48.45 24.84 47.67 21.99Z"/>
                        <path d="M36.0596 30.7505L26.5796 25.2905V36.2105L36.0596 30.7505Z" class="youtubeIcon" fill="white"/>
                    </svg>
                </a>
                <a>
                    <svg xmlns="http://www.w3.org/2000/svg" width="60" height="60" viewBox="0 0 60 60" fill="#333333">
                        <path d="M32.6237 46.4998V31.4469H37.6763L38.4328 25.5806H32.6237V21.8351C32.6237 20.1367 33.0954 18.9791 35.5311 18.9791L38.6376 18.9777V13.7309C38.1001 13.6597 36.2562 13.5 34.1109 13.5C29.6321 13.5 26.5658 16.2337 26.5658 21.2544V25.5807H21.5V31.4471H26.5656V46.5L32.6237 46.4998Z"/>
                    </svg>
                </a>
                <a>
                    <svg xmlns="http://www.w3.org/2000/svg" width="60" height="60" viewBox="0 0 60 60" fill="#333333">
                        <path d="M34.8 30C34.8 30.9494 34.5185 31.8774 33.9911 32.6667C33.4636 33.4561 32.714 34.0713 31.8369 34.4346C30.9598 34.7979 29.9947 34.893 29.0636 34.7078C28.1325 34.5226 27.2772 34.0654 26.6059 33.3941C25.9346 32.7228 25.4774 31.8675 25.2922 30.9364C25.107 30.0053 25.2021 29.0402 25.5654 28.1631C25.9287 27.286 26.5439 26.5364 27.3333 26.0089C28.1226 25.4815 29.0507 25.2 30 25.2C31.2726 25.2015 32.4926 25.7076 33.3925 26.6075C34.2924 27.5074 34.7985 28.7274 34.8 30ZM45 23.4V36.6C44.9975 38.827 44.1117 40.9622 42.5369 42.5369C40.9622 44.1117 38.827 44.9975 36.6 45H23.4C21.173 44.9975 19.0378 44.1117 17.4631 42.5369C15.8883 40.9622 15.0025 38.827 15 36.6V23.4C15.0025 21.173 15.8883 19.0378 17.4631 17.4631C19.0378 15.8883 21.173 15.0025 23.4 15H36.6C38.827 15.0025 40.9622 15.8883 42.5369 17.4631C44.1117 19.0378 44.9975 21.173 45 23.4ZM37.2 30C37.2 28.576 36.7777 27.1839 35.9866 25.9999C35.1954 24.8159 34.0709 23.893 32.7553 23.3481C31.4397 22.8031 29.992 22.6605 28.5954 22.9383C27.1987 23.2162 25.9158 23.9019 24.9088 24.9088C23.9019 25.9158 23.2162 27.1987 22.9383 28.5954C22.6605 29.992 22.8031 31.4397 23.3481 32.7553C23.893 34.0709 24.8159 35.1954 25.9999 35.9866C27.1839 36.7777 28.576 37.2 30 37.2C31.9089 37.1978 33.739 36.4386 35.0888 35.0888C36.4386 33.739 37.1978 31.9089 37.2 30ZM39.6 22.2C39.6 21.844 39.4944 21.496 39.2966 21.2C39.0989 20.904 38.8177 20.6733 38.4888 20.537C38.1599 20.4008 37.798 20.3651 37.4488 20.4346C37.0997 20.504 36.7789 20.6755 36.5272 20.9272C36.2755 21.1789 36.104 21.4997 36.0346 21.8488C35.9651 22.198 36.0008 22.5599 36.137 22.8888C36.2733 23.2177 36.504 23.4989 36.8 23.6966C37.096 23.8944 37.444 24 37.8 24C38.2774 24 38.7352 23.8104 39.0728 23.4728C39.4104 23.1352 39.6 22.6774 39.6 22.2Z"/>
                    </svg>
                </a>
                <a>
                    <svg xmlns="http://www.w3.org/2000/svg" width="60" height="60" viewBox="0 0 60 60" fill="#333333">
                        <path d="M40.3937 31.035C39.9087 30.4225 40.0475 30.15 40.3937 29.6025C40.4 29.5963 44.4037 24.0638 44.8162 22.1875L44.8187 22.1863C45.0237 21.5025 44.8187 21 43.8275 21H40.5475C39.7125 21 39.3275 21.4313 39.1212 21.9138C39.1212 21.9138 37.4512 25.9113 35.0887 28.5025C34.3262 29.2513 33.9737 29.4913 33.5575 29.4913C33.3525 29.4913 33.0337 29.2513 33.0337 28.5675V22.1863C33.0337 21.3663 32.8 21 32.1087 21H26.9512C26.4275 21 26.1162 21.3825 26.1162 21.7388C26.1162 22.5163 27.2975 22.695 27.42 24.8825V29.6288C27.42 30.6688 27.2312 30.86 26.8125 30.86C25.6975 30.86 22.9912 26.8463 21.3875 22.2525C21.0637 21.3613 20.7475 21.0012 19.9062 21.0012H16.625C15.6887 21.0012 15.5 21.4325 15.5 21.915C15.5 22.7675 16.615 27.0063 20.685 32.6063C23.3975 36.4288 27.2175 38.5 30.6925 38.5C32.7812 38.5 33.0362 38.04 33.0362 37.2488C33.0362 33.5963 32.8475 33.2513 33.8937 33.2513C34.3787 33.2513 35.2137 33.4913 37.1637 35.335C39.3925 37.5213 39.7587 38.5 41.0062 38.5H44.2862C45.2212 38.5 45.695 38.04 45.4225 37.1325C44.7987 35.2238 40.5837 31.2975 40.3937 31.035Z"/>
                    </svg>
                </a>
            </div>

         <label class="help_center_main-subscription">С уважением к вам, команда</label>
    </div>
</div>

<div style="display: none;" class="help_center">
    <div class="help_center_header">
        <h1>Отлично!</h1>
        <h3>Введите ваш вопрос в форму и оставьте e-mail:</h3>
        <button class="help_center_header-close">
            <svg xmlns="http://www.w3.org/2000/svg" width="60" height="60" viewBox="0 0 60 60" fill="none">
            <rect x="21.0712" y="37.0712" width="22" height="2" rx="1" transform="rotate(-45 21.0712 37.0712)" fill="#8D97A2"/>
            <rect x="36.6273" y="38.4854" width="22" height="2" rx="1" transform="rotate(-135 36.6273 38.4854)" fill="#8D97A2"/>
            </svg>
        </button>
    </div>
    <div class="help_center_main">
        <img src="{{ asset('site/assets/images/ask_person.svg')}}"/>
        <textarea placeholder="Пожалуйста, введите ваш вопрос"></textarea>
        <div class="help_center_main-form">
            <span class="help_center_main-form-email">
                E-mail*
                <input type="text" placeholder="Ваш e-mail">
            </span>
            <a class="help_center_main-form-submit" href="">Ответьте мне</a>

            <span class="help_center_main-form-policy">Оставляя свои контактные, данные вы соглашаетесь с условиями
                <a href="">пользовательского соглашения</a> и <a href="">политикой конфиденциальности</a>
            </span>

         </div>
         <label class="help_center_main-subscription">С уважением к вам, команда</label>
    </div>
</div>


<div class="fon1">
    <img src="{{ asset('site/assets/images/look1.png')}}" alt="fon">
</div>

    @include('site.inc.looking')
<div class="fon1 l">
    <img src="{{ asset('site/assets/images/look2.png')}}" alt="fon">
</div>
</section>
    @include('site.inc.contacts')
@endsection

@if(isset($scrollToError) && $scrollToError)
<script>
    window.onload = function() {
        var scroll = document.getElementById('error');
        scroll.scrollIntoView({ behavior: 'smooth' });
    };
</script>
@endif
